# frozen_string_literal: true

# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

Point.create(name: 'Офис "Burning Buttons"',
             description: 'Здесь родилась идея',
             coordinates: '54.985387, 73.387598',
             tags: '')
Point.create(name: 'Кабинет стажеров',
             description: 'Здесь все было сделано',
             coordinates: '54.984742, 73.387395',
             tags: '')
Point.create(name: 'Памятник маршалу Жукову',
             description: 'Памятник Г. К. Жукову – творение омских скульпторов и архитекторов. По замыслу авторов проекта памятник возвышается на зеленом искусственном холме-призме, от уровня земли до вершины холма – 11,5 метра. Подпорные стенки украшают геральдические барельефы с названиями дивизий, сформированных в Омске и отправленных на фронт в годы Великой Отечественной войны.',
             coordinates: '54.983916, 73.387598',
             tags: '')
Point.create(name: 'Музыкальный театр',
             description: '«Омский государственный музыкальный театр» — один из ведущих театров города Омска, в репертуаре которого музыкальные произведения разных жанров, от классической оперы до новаторского балета.',
             coordinates: '54.982418, 73.382786',
             tags: '')
Point.create(name: 'СКК им. Блинова',
             description: 'Спортивно-концертный комплекс имени В. Блинова (до 2000 года — СКК «Иртыш») — универсальный крытый комплекс в Омске, один из крупнейших за Уралом.',
             coordinates: '54.975372, 73.396450',
             tags: '')
Point.create(name: 'Омский государственный цирк',
             description: 'Омский государственный цирк является продолжателем циркового дела в Омске, начавшегося в 1898 году с деревянного цирка-театра купца Сичкарёва. В 1908 году деревянный цирк был заменён временным, а в 1922 году начал работу советский цирк. В годы Великой Отечественной войны в город был эвакуирован белорусский государственный цирк из Минска.',
             coordinates: '54.956114, 73.389024',
             tags: '')
Point.create(name: 'ТЮЗ',
             description: 'Омский театр для детей и молодёжи — Театр Омска, более известный как Омский ТЮЗ, с обширным репертуаром, предназначенным для просмотра любой возрастной аудиторией: среди постановок есть спектакли как для самых маленьких зрителей, так и для взрослых. Многие бывшие актёры театра сегодня успешно работают в Москве и Санкт-Петербурге, снимаются в кино и рекламе',
             coordinates: '54.979150, 73.379340',
             tags: '')
Point.create(name: 'Концертный зал филармонии',
             description: 'Здание Концертного зала было построено в 1967 году по проекту архитектора Альберта Каримова. Он был задуман как комбинированный комплекс для проката кино и организации концертов крупнейших творческих коллективов области и всей страны в целом. Новый зал располагал не только рекордным в городе количеством зрительских мест – 1200, но и самым большим экраном, широкой сценой и специальным акустическим решением, способным вписаться в данный комплекс.',
             coordinates: '54.976891, 73.378838',
             tags: '')
Point.create(name: 'Омский кадетский военный корпус',
             description: 'Омский кадетский корпус (до 1925 г. — 1-й Сибирский императора Александра I кадетский корпус) — старейшее и ведущее военное учебное заведение Сибири, выпустившее за всю свою историю блестящую плеяду маршалов, генералов, офицеров, сержантов и кадет, выдающихся и известных государственных, политических, научных и общественных деятелей.',
             coordinates: '54.977199, 73.377604',
             tags: '')
Point.create(name: 'Омская крепость',
             description: 'Омская крепость - сторожевое укрепление Сибирской линии, возведенной в XVIII—XIX веках для защиты южных границ от набегов кочевников. С постройки первой крепости, воздвигнутой в 1716 году в виду двух редутов, началась история города Омск. Благодаря наличию крепости Омск стал главным городом Западной Сибири.',
             coordinates: '54.985009, 73.362513',
             tags: '')
